var arr = new Array();
arr[0] = "'中原区','二七区'"
arr[1] = "'中原区','二七区','管城回族区','金水区','上街区','邙山区','中牟县','巩义市','荥阳市','新密市','新郑市','登封市'"
arr[2] = "'龙亭区','顺河回族区','鼓楼区','南关区','郊　区','杞　县','通许县','尉氏县','开封县','兰考县'"
arr[3] = "'老城区','西工区','廛河回族区','涧西区','吉利区','洛龙区','孟津县','新安县','栾川县','嵩　县','汝阳县','宜阳县','洛宁县','伊川县','偃师市'"
arr[4] = "'新华区','卫东区','石龙区','湛河区','宝丰县','叶　县','鲁山县','郏　县','舞钢市','汝州市'"
arr[5] = "'文峰区','北关区','殷都区','龙安区','安阳县','汤阴县','滑　县','内黄县','林州市'"
arr[6] = "'鹤山区','山城区','淇滨区','浚　县','淇　县'"
arr[7] = "'红旗区','卫滨区','凤泉区','牧野区','新乡县','获嘉县','原阳县','延津县','封丘县','长垣县','卫辉市','辉县市'"
arr[8] = "'解放区','中站区','马村区','山阳区','修武县','博爱县','武陟县','温　县','济源市','沁阳市','孟州市'"
arr[9] = "'华龙区','清丰县','南乐县','范　县','台前县','濮阳县'"
arr[10] = "'魏都区','许昌县','鄢陵县','襄城县','禹州市','长葛市'"
arr[11] = "'源汇区','郾城区','召陵区','舞阳县','临颍县'"
arr[12] = "'湖滨区','渑池县','陕　县','卢氏县','义马市','灵宝市'"
arr[13] = "'宛城区','卧龙区','南召县','方城县','西峡县','镇平县','内乡县','淅川县','社旗县','唐河县','新野县','桐柏县','邓州市'"
arr[14] = "'梁园区','睢阳区','民权县','睢　县','宁陵县','柘城县','虞城县','夏邑县','永城市'"
arr[15] = "'师河区','平桥区','罗山县','光山县','新　县','商城县','固始县','潢川县','淮滨县','息　县'"
arr[16] = "'川汇区','扶沟县','西华县','商水县','沈丘县','郸城县','淮阳县','太康县','鹿邑县','项城市'"
arr[17] = "'驿城区','西平县','上蔡县','平舆县','正阳县','确山县','泌阳县','汝南县','遂平县','新蔡县'"

function init() {
	var city = document.getElementById("city");
	var cityArr = arr[0].split(",");
	for(var i = 0; i < cityArr.length; i++) {
		city[i] = new Option(cityArr[i], cityArr[i]);
	}
}

function getCity() {
	var pro = document.getElementById("city1");
	var city = document.getElementById("city");
	var index = pro.selectedIndex;
	var cityArr = arr[index].split(",");

	city.length = 0;
	//将城市数组中的值填充到城市下拉框中
	for(var i = 0; i < cityArr.length; i++) {
		city[i] = new Option(cityArr[i], cityArr[i]);
	}
}
//window.onload=init();